### PANDAS 쪽지 시험

- 1. 데이터를 저장 후 몇 가지 문제를 코드로 작성합니다.
이름 | 가격 | 재고  
-------------------------------------------------
메로나 | 300 | 20    
비비빅 | 400 | 3    
죠스바 | 250 | 100

In [183]:
import pandas as pd

In [184]:
# (1-01) 데이터를 저장해 주세요.
data1=dict({'이름':['메로나','비비빅','죠스바'],
'가격':[300,400,250],
'재고':[30,3,100]})

DF1=pd.DataFrame(data1)
DF1

    이름   가격   재고
0  메로나  300   30
1  비비빅  400    3
2  죠스바  250  100

In [185]:
#(1-02) 데이터 저장 후 주요 속성 6가지를 출력하세요.
print(DF1.values)
print(DF1.columns)
print(DF1.index)
print(DF1.shape)
print(DF1.dtypes)
print(DF1.ndim)

[['메로나' 300 30]
 ['비비빅' 400 3]
 ['죠스바' 250 100]]
Index(['이름', '가격', '재고'], dtype='object')
RangeIndex(start=0, stop=3, step=1)
(3, 3)
이름    object
가격     int64
재고     int64
dtype: object
2

In [186]:
#(1-03) 가격 데이터만 추출하세요.
DF1['가격']

0    300
1    400
2    250
Name: 가격, dtype: int64

In [187]:
#(1-04) 이름과 재고 데이터 추출
DF1[['이름','재고']]

    이름   재고
0  메로나   30
1  비비빅    3
2  죠스바  100

In [188]:
#(1-05) 비비빅의 가격과 재고 데이터 추출
DF1.iloc[['1']]

    이름   가격  재고
1  비비빅  400   3

In [189]:
#(1-07) 행 인덱스를 '일','이','삼'으로 변경
DF1.index=['일','이','삼']
DF1

    이름   가격   재고
일  메로나  300   30
이  비비빅  400    3
삼  죠스바  250  100

In [190]:
#(1-08) 
DF1['총가격']=0

In [191]:
DF1

    이름   가격   재고  총가격
일  메로나  300   30    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [192]:
#1-09 
DF1.loc['사']=['빵빠레',500,10,0]
DF1

    이름   가격   재고  총가격
일  메로나  300   30    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
사  빵빠레  500   10    0

In [193]:
#1-10
DF1.loc['이','재고']=23
DF1

    이름   가격   재고  총가격
일  메로나  300   30    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
사  빵빠레  500   10    0

##### 3. 아래 단답형 문제에 답해주세요.   
(3-01) 판다스는 (데이터)를 분석하기 위한 패키지입니다.  
(3-02) 판다스에서는 다양한 종류의 데이터를 ( DF)형태로 저장합니다.  
(3-03) 판다스에서는 1차원 데이터를 저장하는 자료구조를 (시리즈 )라고 합니다.  
(3-04) 판다스에서는 2차원 데이터를 저장하는 자료구조를 (DF)라고 합니다.  
(3-05) 판다스는 내부적으로 데이터를 (array )형태로 저장합니다.  
(3-06) 판다스에서는 1개 열/column 추출 시 자료구조는 (시리즈)입니다.  
(3-07) 판다스에서는 1개 행/row 추출 시 자료구조는 (DF )입니다.  
(3-08) 판다스에서는 2개 이상 열/column 또는 행/row 추출 시 자료구조는(DF )입니다.

- OHLC(Open/High/Low/Close) 가격정보 데이터입니다.  
(OHLC : 시가(open), 고가 (high), 저가 (low) , 종가(close))  
data = [ [ 2000, 3050, 2050, 1980], [ 7500, 2050, 2050, 1980], [15450, 15050, 15550, 14900]]

In [194]:
#(2-01) 데이터를 저장해 주세요.
data2=[ [ 2000, 3050, 2050, 1980], [ 7500, 2050, 2050, 1980], [15450, 15050, 15550, 14900]]

In [195]:
DF2=pd.DataFrame(data2)
DF2

       0      1      2      3
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [196]:
DF2.columns=['시가','고가','저가','종가']

In [197]:
DF2

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [198]:
#2-02
print(DF2.values)
print(DF2.columns)
print(DF2.index)
print(DF2.shape)
print(DF2.dtypes)
print(DF2.ndim)

[[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050 15550 14900]]
Index(['시가', '고가', '저가', '종가'], dtype='object')
RangeIndex(start=0, stop=3, step=1)
(3, 4)
시가    int64
고가    int64
저가    int64
종가    int64
dtype: object
2

In [199]:
#2-03
DF2.index=['2024-01-01','2024-02-01','2024-03-01']
DF2

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [200]:
#2-04
DF2.columns=['Open','High','Low','Close']

In [201]:
DF2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [202]:
#2-05